85hzc/ask_433/stm32f4/Project/timepwm.c

#include "stm32f4xx.h"
#include "led.h"
#include "delay.h"
#include "key.h"
#include "usart.h"
#include "gpio.h" 
#include "mbi5153.h"

#if(TWO_TIMER_PULSE==1)
/*定时器1主模式*/
void TIM1_config(u32 Cycle)
{

    GPIO_InitTypeDef GPIO_InitStructure;
    TIM_TimeBaseInitTypeDef  TIM_TimeBaseStructure;
    TIM_OCInitTypeDef  TIM_OCInitStructure;

    RCC_APB2PeriphClockCmd(RCC_APB2Periph_TIM1 , ENABLE); 
    RCC_AHB1PeriphClockCmd(RCC_AHB1Periph_GPIOE, ENABLE); 	//初始化GPIOG时钟

    GPIO_PinAFConfig(GPIOE,GPIO_PinSource9,GPIO_AF_TIM1); //GPIOF9??????14

    GPIO_InitStructure.GPIO_Pin = GPIO_Pin_9;
    GPIO_InitStructure.GPIO_Mode = GPIO_Mode_AF;					//复用
    GPIO_InitStructure.GPIO_Speed = GPIO_Speed_50MHz;
    GPIO_InitStructure.GPIO_OType = GPIO_OType_PP;				//推挽输出
    GPIO_InitStructure.GPIO_PuPd = GPIO_PuPd_DOWN;					//上拉
    GPIO_Init(GPIOE, &GPIO_InitStructure);

    TIM_TimeBaseStructure.TIM_Period = Cycle-1;
    TIM_TimeBaseStructure.TIM_Prescaler =21;                    //设置用来作为TIMx时钟频率除数的预分频值                                    
    TIM_TimeBaseStructure.TIM_ClockDivision = TIM_CKD_DIV1;     //设置时钟分割:TDTS= Tck_tim
    TIM_TimeBaseStructure.TIM_CounterMode = TIM_CounterMode_Up; //TIM向上计数
    TIM_TimeBaseStructure.TIM_RepetitionCounter = 0;            //重复计数，一定要=0!!!
    TIM_TimeBaseInit(TIM1, &TIM_TimeBaseStructure);                                       

    TIM_OCInitStructure.TIM_OCMode = TIM_OCMode_PWM1;          //选择定时器模式:TIM脉冲宽度调制模式1    
    TIM_OCInitStructure.TIM_OutputState = TIM_OutputState_Enable; //比较输出使能
    TIM_OCInitStructure.TIM_Pulse = Cycle/2-1;                    //设置待装入捕获寄存器的脉冲值                    
    TIM_OCInitStructure.TIM_OCPolarity = TIM_OCPolarity_Low;      //输出极性
    TIM_OC1Init(TIM1, &TIM_OCInitStructure);

    TIM_SelectMasterSlaveMode(TIM1, TIM_MasterSlaveMode_Enable);
    TIM_SelectOutputTrigger(TIM1, TIM_TRGOSource_Update);

    TIM_OC1PreloadConfig(TIM1, TIM_OCPreload_Enable);
    TIM_ARRPreloadConfig(TIM1, ENABLE);
}

/***???2???***/
void TIM2_config(u32 PulseNum)
{
    TIM_TimeBaseInitTypeDef  TIM_TimeBaseStructure;
    NVIC_InitTypeDef NVIC_InitStructure; 
    RCC_APB1PeriphClockCmd(RCC_APB1Periph_TIM2, ENABLE);

    TIM_TimeBaseStructure.TIM_Period = PulseNum-1;
    TIM_TimeBaseStructure.TIM_Prescaler =14;
    TIM_TimeBaseStructure.TIM_ClockDivision = TIM_CKD_DIV1;
    TIM_TimeBaseStructure.TIM_CounterMode = TIM_CounterMode_Up;
    TIM_TimeBaseInit(TIM2, &TIM_TimeBaseStructure);

    TIM_SelectInputTrigger(TIM2, TIM_TS_ITR0);
    //TIM_InternalClockConfig(TIM3);
    TIM2->SMCR|=0x07;   //???????? 
    //TIM_ITRxExternalClockConfig(TIM2, TIM_TS_ITR0);

    //TIM_ARRPreloadConfig(TIM3, ENABLE);
    TIM_ITConfig(TIM2,TIM_IT_Update,DISABLE);

   // NVIC_PriorityGroupConfig(NVIC_PriorityGroup_3);
    NVIC_InitStructure.NVIC_IRQChannel = TIM2_IRQn;
    NVIC_InitStructure.NVIC_IRQChannelPreemptionPriority = 0;
    NVIC_InitStructure.NVIC_IRQChannelSubPriority = 0;
    NVIC_InitStructure.NVIC_IRQChannelCmd = ENABLE;
    NVIC_Init(&NVIC_InitStructure);
}

void Pulse_output(u32 Cycle,u32 PulseNum)
{
    printf("Pulse_output Cycle %d,PulseNum %d\r\n",Cycle,PulseNum);
#if 1
    TIM2_config(PulseNum);
    TIM_Cmd(TIM2, ENABLE);
    TIM_ClearITPendingBit(TIM2,TIM_IT_Update);
    TIM_ITConfig(TIM2,TIM_IT_Update,ENABLE);
#endif
    TIM1_config(Cycle);
    TIM_Cmd(TIM1, ENABLE);
    TIM_CtrlPWMOutputs(TIM1, ENABLE);   //??????????,?????
}

int8_t pre_vsync=0,gclk_num=5;

void TIM2_IRQHandler(void)
{

    printf("TIM2_IRQHandler gclk_num %d\r\n",gclk_num);

    if (TIM_GetITStatus(TIM2, TIM_IT_Update) != RESET)     // TIM_IT_CC1
    {
        printf("TIM2_IRQHandler SET\r\n");
        TIM_ClearITPendingBit(TIM2, TIM_IT_Update); // ??????? 
        TIM_CtrlPWMOutputs(TIM1, DISABLE);  //?????
        TIM_Cmd(TIM1, DISABLE); // ????? 
        TIM_Cmd(TIM2, DISABLE); // ????? 
        TIM_ITConfig(TIM2, TIM_IT_Update, DISABLE);
/*
        gclk_num++;

        if(pre_vsync == 0 && gclk_num < GCLKNUM-1)
        {
            printf("TIM2_IRQHandler output pwm\r\n");
            //Pulse_output(100,10);
            TIM_Cmd(TIM2, ENABLE);
            TIM_ClearITPendingBit(TIM2,TIM_IT_Update);
            TIM_ITConfig(TIM2,TIM_IT_Update,ENABLE);
            TIM_Cmd(TIM1, ENABLE);
            TIM_CtrlPWMOutputs(TIM1, ENABLE);
        }
*/
    }
}
#else

#if 0
//TIM14 PWM????? 
//PWM?????
//arr:?????
//psc:??????
void TIM14_PWM_Init(u32 arr,u32 psc)
{
	//????????IO???
	
	GPIO_InitTypeDef GPIO_InitStructure;
	TIM_TimeBaseInitTypeDef  TIM_TimeBaseStructure;
	TIM_OCInitTypeDef  TIM_OCInitStructure;

	RCC_APB1PeriphClockCmd(RCC_APB1Periph_TIM14,ENABLE);  	//TIM14????
	RCC_AHB1PeriphClockCmd(RCC_AHB1Periph_GPIOF, ENABLE); 	//??PORTF??	

	GPIO_PinAFConfig(GPIOF,GPIO_PinSource9,GPIO_AF_TIM14); //GPIOF9??????14

	GPIO_InitStructure.GPIO_Pin = GPIO_Pin_9;           //GPIOF9
	GPIO_InitStructure.GPIO_Mode = GPIO_Mode_AF;        //????
	GPIO_InitStructure.GPIO_Speed = GPIO_Speed_100MHz;	//??100MHz
	GPIO_InitStructure.GPIO_OType = GPIO_OType_PP;      //??????
	GPIO_InitStructure.GPIO_PuPd = GPIO_PuPd_UP;        //??
	GPIO_Init(GPIOF,&GPIO_InitStructure);              //???PF9

	TIM_TimeBaseStructure.TIM_Prescaler=psc;  //定时器分频
	TIM_TimeBaseStructure.TIM_CounterMode=TIM_CounterMode_Up; //向上计数
	TIM_TimeBaseStructure.TIM_Period=arr;   //自动重载
	TIM_TimeBaseStructure.TIM_ClockDivision=TIM_CKD_DIV1;
	TIM_TimeBaseInit(TIM14,&TIM_TimeBaseStructure);//??????14
	//???TIM14 Channel1 PWM??
	TIM_OCInitStructure.TIM_OCMode = TIM_OCMode_PWM1; //???????:TIM????????2
 	TIM_OCInitStructure.TIM_OutputState = TIM_OutputState_Enable; //??????
	TIM_OCInitStructure.TIM_OCPolarity = TIM_OCPolarity_Low; //????:TIM???????
	TIM_OC1Init(TIM14, &TIM_OCInitStructure);  //??T??????????TIM1 4OC1

	TIM_OC1PreloadConfig(TIM14, TIM_OCPreload_Enable);  //??TIM14?CCR1????????

	TIM_ARRPreloadConfig(TIM14,ENABLE);//ARPE??
	TIM_Cmd(TIM14, ENABLE);  //??TIM14
}

#else
void TIM1_PWM_Init(u32 arr,u32 psc)
{
	
	GPIO_InitTypeDef GPIO_InitStructure;
	TIM_TimeBaseInitTypeDef  TIM_TimeBaseStructure;
	TIM_OCInitTypeDef  TIM_OCInitStructure;

	RCC_APB2PeriphClockCmd(RCC_APB2Periph_TIM1 , ENABLE); 
	RCC_AHB1PeriphClockCmd(RCC_AHB1Periph_GPIOE, ENABLE); 	//??PORTF??	

	GPIO_PinAFConfig(GPIOE,GPIO_PinSource9,GPIO_AF_TIM1); //GPIOF9??????14

	GPIO_InitStructure.GPIO_Pin = GPIO_Pin_9;           //GPIOF9
	GPIO_InitStructure.GPIO_Mode = GPIO_Mode_AF;        //????
	GPIO_InitStructure.GPIO_Speed = GPIO_Speed_100MHz;	//??100MHz
	GPIO_InitStructure.GPIO_OType = GPIO_OType_PP;      //??????
	GPIO_InitStructure.GPIO_PuPd = GPIO_PuPd_DOWN;        //??
	GPIO_Init(GPIOE,&GPIO_InitStructure);              //???PF9

	TIM_TimeBaseStructure.TIM_Prescaler=psc;  //定时器分频
	TIM_TimeBaseStructure.TIM_CounterMode=TIM_CounterMode_Up; //向上计数
	TIM_TimeBaseStructure.TIM_Period=arr;   //自动重载
	TIM_TimeBaseStructure.TIM_ClockDivision=TIM_CKD_DIV1;
	TIM_TimeBaseInit(TIM1,&TIM_TimeBaseStructure);//??????14
	//???TIM14 Channel1 PWM??
	TIM_OCInitStructure.TIM_OCMode = TIM_OCMode_PWM1; //???????:TIM????????2
 	TIM_OCInitStructure.TIM_OutputState = TIM_OutputState_Enable; //??????
	TIM_OCInitStructure.TIM_OCPolarity = TIM_OCPolarity_Low; //????:TIM???????
	TIM_OC1Init(TIM1, &TIM_OCInitStructure);  //??T??????????TIM1 4OC1

	TIM_OC1PreloadConfig(TIM1, TIM_OCPreload_Enable);  //??TIM14?CCR1????????

	TIM_ARRPreloadConfig(TIM1,ENABLE);//ARPE??
	TIM_Cmd(TIM1, ENABLE);  //??TIM14
}
#endif
#endif

#if(TIMER==3)

//通用定时器3中断初始化
//arr：自动重装值。
//psc：时钟预分频数
//定时器溢出时间计算方法:Tout=((arr+1)*(psc+1))/Ft us.
//Ft=定时器工作频率,单位:Mhz
//这里使用的是定时器3!
void TIM3_Int_Init(u16 arr,u16 psc)
{
    TIM_TimeBaseInitTypeDef TIM_TimeBaseInitStructure;
	NVIC_InitTypeDef NVIC_InitStructure;
	
	RCC_APB1PeriphClockCmd(RCC_APB1Periph_TIM3,ENABLE);  ///ê1?üTIM3ê±?ó
	
      TIM_TimeBaseInitStructure.TIM_Period = arr; 	//×??ˉ??×°???μ
	TIM_TimeBaseInitStructure.TIM_Prescaler=psc;  //?¨ê±?÷·??μ
	TIM_TimeBaseInitStructure.TIM_CounterMode=TIM_CounterMode_Up; //?òé???êy?￡ê?
	TIM_TimeBaseInitStructure.TIM_ClockDivision=TIM_CKD_DIV1; 
	
	TIM_TimeBaseInit(TIM3,&TIM_TimeBaseInitStructure);//3?ê??ˉTIM3
	
	TIM_ITConfig(TIM3,TIM_IT_Update,ENABLE); //?êDí?¨ê±?÷3?üD??D??
	TIM_Cmd(TIM3,ENABLE); //ê1?ü?¨ê±?÷3
	
	NVIC_InitStructure.NVIC_IRQChannel=TIM3_IRQn; //?¨ê±?÷3?D??
	NVIC_InitStructure.NVIC_IRQChannelPreemptionPriority=0x01; //?à??ó??è??1
	NVIC_InitStructure.NVIC_IRQChannelSubPriority=0x03; //×óó??è??3
	NVIC_InitStructure.NVIC_IRQChannelCmd=ENABLE;
	NVIC_Init(&NVIC_InitStructure);
}

//定时器3中断服务函数
void TIM3_IRQHandler(void)
{
    uint16_t i;
    printf("IRQ TIM3_IRQHandler\r\n");//DS1翻转

	if(TIM_GetITStatus(TIM3,TIM_IT_Update)==SET) //溢出中断
	{
        TIM_ClearITPendingBit(TIM3,TIM_IT_Update);  //清除中断标志位
        TIM_Cmd(TIM3,DISABLE);
		printf("IRQ tim3 SET\r\n");
		MBI_ScanDisplay();
        //TIM_Cmd(TIM3,DISABLE);
        //for(i=0;i<129;i++)
        //    gclk();

        TIM_Cmd(TIM3,ENABLE);
	}
}

/***???2???***/
void TIM2_config(u32 PulseNum)
{
    TIM_TimeBaseInitTypeDef  TIM_TimeBaseStructure;
    NVIC_InitTypeDef NVIC_InitStructure; 
    RCC_APB1PeriphClockCmd(RCC_APB1Periph_TIM2, ENABLE);

    TIM_TimeBaseStructure.TIM_Period = PulseNum-1;
    TIM_TimeBaseStructure.TIM_Prescaler =84;
    TIM_TimeBaseStructure.TIM_ClockDivision = TIM_CKD_DIV1;
    TIM_TimeBaseStructure.TIM_CounterMode = TIM_CounterMode_Up;
    TIM_TimeBaseInit(TIM2, &TIM_TimeBaseStructure);
/*
    TIM_SelectInputTrigger(TIM2, TIM_TS_ITR0);
    //TIM_InternalClockConfig(TIM3);
    TIM2->SMCR|=0x07;   //???????? 
    //TIM_ITRxExternalClockConfig(TIM2, TIM_TS_ITR0);
*/
    //TIM_ARRPreloadConfig(TIM3, ENABLE);
    TIM_ITConfig(TIM2,TIM_IT_Update,DISABLE);

   // NVIC_PriorityGroupConfig(NVIC_PriorityGroup_3);
    NVIC_InitStructure.NVIC_IRQChannel = TIM2_IRQn;
    NVIC_InitStructure.NVIC_IRQChannelPreemptionPriority = 0;
    NVIC_InitStructure.NVIC_IRQChannelSubPriority = 0;
    NVIC_InitStructure.NVIC_IRQChannelCmd = ENABLE;
    NVIC_Init(&NVIC_InitStructure);
}


void TIM2_IRQHandler(void)
{

    printf("TIM2_IRQHandler \r\n");

    if (TIM_GetITStatus(TIM2, TIM_IT_Update) != RESET)     // TIM_IT_CC1
    {
        printf("TIM2_IRQHandler SET\r\n");

        TIM_ClearITPendingBit(TIM2, TIM_IT_Update); // ??????? 
        /*
        TIM_Cmd(TIM2, DISABLE); // ????? 
*/
        TIM_ITConfig(TIM2, TIM_IT_Update, DISABLE);

        MBI_ScanDisplay();

        //TIM_Cmd(TIM2,ENABLE);
        //TIM_ClearITPendingBit(TIM2, TIM_IT_Update); // ??????? 
        TIM_ITConfig(TIM2, TIM_IT_Update, ENABLE);

    }
}

#endif
